renesas/rx-driver-package/source/r_qspi_smstr_rx/r_qspi_smstr_rx_vx.xx/r_qspi_smstr_rx/src/targets/rx71m/r_qspi_smstr_target_dev_port.c
/*******************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only
* intended for use with Renesas products. No other uses are authorized. This
* software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT
* LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
* AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR
* ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software
* and to discontinue the availability of this software. By using this software,
* you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2014 Renesas Electronics Corporation. All rights reserved.
*******************************************************************************/
/*******************************************************************************
* System Name  : QSPI single master driver
* File Name    : r_qspi_smstr_target_dev_port.c
* Version      : 1.21
* Device       : RX
* Abstract     : Source file dedicated to RX71M for QSPI single master driver
* Tool-Chain   : Renesas RXC Toolchain v3.05.00
* OS           : not use
* H/W Platform : not use
* Description  : Functions for QSPI single master driver
* Limitation   : none
*******************************************************************************/
/*******************************************************************************
* History      : DD.MM.YYYY Version  Description
*              : 24.06.2014 1.05     First Release
*              : 29.08.2014 1.06     Not change program due to changing r_qspi_smstr_private.h.
*              :                     Added demo source for DTC in this driver.
*              : 28.11.2014 1.07     Added R_QSPI_SMstr_1ms_Interval(), r_qspi_smstr_start_timer(),
*              :                     r_qspi_smstr_check_timer() and r_qspi_smstr_end_timer().
*              :                     Changed r_qspi_smstr_tx_dmacdtc_wait() and r_qspi_smstr_rx_dmacdtc_wait().
*              : 30.01.2015 1.08     Added RX71M.
*              : 30.09.2016 1.09     Changed Tool-Chain version.
*              :                     Changed pin name.
*              :                     Added nop() to wait for the write completion.
*              : 31.07.2017 1.10     Modified register protect processing.
*                                    Fixed to correspond to Renesas coding rule.
*              : 20.05.2019 1.12     Added support for GNUC and ICCRX.
*              :                     Fixed coding style. 
*              : 30.07.2019 1.13     Added WAIT LOOP.
*              : 22.11.2019 1.14     Added support for atomic control.
*              : 22.11.2019 1.14     Modified comment of API function to Doxygen style.
*              : 15.06.2023 1.21     Fixed typo in the comment of the r_qspi_smstr_check_timer()
*              :                     Fixed typo in the comment of the r_qspi_smstr_tx_dmacdtc_wait()
*              :                     Fixed typo in the comment of the r_qspi_smstr_rx_dmacdtc_wait()
*******************************************************************************/

/*******************************************************************************
Includes <System Includes> , "Project Includes"
*******************************************************************************/
/* Public interface header file for this package. */
#include "r_qspi_smstr_rx_if.h"
/* Configuration for this package. */
#include "r_qspi_smstr_rx_config.h"
/* Private header file for this package. */
#include "./src/r_qspi_smstr_private.h"

/* Check MCU Group */
#if defined(BSP_MCU_RX71M)


/*******************************************************************************
Macro definitions
*******************************************************************************/
#define QSPI_TIMER_CH_FLG          (0)
#define QSPI_TIMER_CH_COUNT        (1)
#define QSPI_TIMER_CH_MAX_COUNT    (2)
#define QSPI_TIMER_MIN_TIME        (100)       /* 100ms                    */
#define QSPI_SECTOR_SIZE           (512)       /* 1 sector size            */


/*******************************************************************************
Private variables and functions
*******************************************************************************/
static volatile uint8_t  gs_qspi_int_spti_dmacdtc_flg[QSPI_NUM_CHANNELS];
static volatile uint8_t  gs_qspi_int_spri_dmacdtc_flg[QSPI_NUM_CHANNELS];
static volatile uint32_t gs_qspi_timer_cnt_out[QSPI_NUM_CHANNELS][QSPI_TIMER_CH_MAX_COUNT + 1];

static void                 r_qspi_smstr_start_timer(uint8_t channel, uint32_t msec);
static qspi_smstr_status_t  r_qspi_smstr_check_timer(uint8_t channel);
static void                 r_qspi_smstr_end_timer(uint8_t channel);

#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
R_BSP_PRAGMA_STATIC_INTERRUPT(r_qspi_smstr_spti_isr0, VECT(QSPI, SPTI))
R_BSP_ATTRIB_STATIC_INTERRUPT void r_qspi_smstr_spti_isr0(void)
{
    R_QSPI_SMstr_Int_Spti_Ier_Clear(0);
    R_QSPI_SMstr_Int_Spti_Dmacdtc_Flag_Set(0, QSPI_SET_TRANS_STOP);
}

R_BSP_PRAGMA_STATIC_INTERRUPT(r_qspi_smstr_spri_isr0, VECT(QSPI, SPRI))
R_BSP_ATTRIB_STATIC_INTERRUPT void r_qspi_smstr_spri_isr0(void)
{
    R_QSPI_SMstr_Int_Spri_Ier_Clear(0);
    R_QSPI_SMstr_Int_Spri_Dmacdtc_Flag_Set(0, QSPI_SET_TRANS_STOP);
}
#endif  /* defined(QSPI_SMSTR_CFG_CH0_INCLUDED) */


