renesas/rx-driver-package/source/r_qspi_smstr_rx/r_qspi_smstr_rx_vx.xx/r_qspi_smstr_rx/src/targets/rx71m/r_qspi_smstr_target_dev_port.c
/*******************************************************************************
* Function Name: r_qspi_smstr_clk_reset
* Description  : Resets setting of port for QSPCLK.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_clk_reset(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* ---- Setting of port for QSPCLK ---- */
            QSPI_CH0_PDR_CLK    = QSPI_SMSTR_IN;    /* Select input direction.                  */
            QSPI_CH0_PODR_CLK   = QSPI_SMSTR_LOW;   /* Output data is Low.                      */
    #if (('7' != R_QSPI_SMSTR_CFG_QSPI_QSPCLK_PORT) && ('7' != R_QSPI_SMSTR_CFG_QSPI_QSPCLK_BIT))
            QSPI_CH0_DSCR_CLK   = 0;                /* Drive capacity is normal drive output.   */
    #endif
            QSPI_CH0_ODR_CLK    = 0;                /* Output type is CMOS output.              */
            if (0 == QSPI_CH0_ODR_CLK)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_module_enable
* Description  : Releases module stop state.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_module_enable(uint8_t channel)
{
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif
#endif
    /* Enable writing to registers. */
#ifdef QSPI_SMSTR_CFG_USE_FIT
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
#else
    QSPI_PRCR = QSPI_PRCR_ENABLE;
    if (QSPI_PRCR_ENABLE == QSPI_PRCR)
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
#endif /* QSPI_SMSTR_CFG_USE_FIT */
    
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
        #endif
            MSTP(QSPI) = 0;
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
        #endif
            if (0 == MSTP(QSPI))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
    
    /* Disable writing to registers. */
#ifdef QSPI_SMSTR_CFG_USE_FIT
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
#else
    QSPI_PRCR = QSPI_PRCR_DISABLE;
    if (QSPI_PRCR_DISABLE == QSPI_PRCR)
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
#endif /* QSPI_SMSTR_CFG_USE_FIT */
}


/*******************************************************************************
* Function Name: r_qspi_smstr_module_disable
* Description  : Sets the Module Stop of QSPI.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_module_disable(uint8_t channel)
{
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif
#endif
    /* Enable writing to registers. */
    QSPI_PRCR = QSPI_PRCR_ENABLE;
    if (QSPI_PRCR_ENABLE == QSPI_PRCR)
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
    
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
        #endif
            MSTP(QSPI) = 1;
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
        #endif
            if (1 == MSTP(QSPI))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
    
    /* Disable writing to registers. */
    QSPI_PRCR = QSPI_PRCR_DISABLE;
    if (QSPI_PRCR_DISABLE == QSPI_PRCR)
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_tx_dmacdtc_wait
* Description  : Waits for transmission completion.
* Arguments    : channel -
*                    Which channel to use
*                size -
*                    Size of data
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_HARD -
*                    Hardware error
*******************************************************************************/
qspi_smstr_status_t r_qspi_smstr_tx_dmacdtc_wait(uint8_t channel, uint32_t size)
{
    qspi_smstr_status_t    ret  = QSPI_SMSTR_SUCCESS;
    uint32_t               time = QSPI_TIMER_MIN_TIME;     /* 100ms        */

